# Алгоритм вычисления функции F(n) задан следующими соотношениями
def F(n):
  if n == 1:
    return 1
  if n % 2 == 0:
    return n + F(n - 1)
  elif n > 1:
    return 2 * F(n - 2)
# Чему равно значение функции F(26)?
print(F(26))

# ====================================================================================================

# Определите наименьшее значение n, при котором сумма чисел, которые будут выведены при вызове F(n), будет больше
# 500000. Запишите в ответе сначала найденное значение n, а затем через пробел – соответствующую сумму выведенных чисел
sum = 0
def F(n):
  global sum
  sum += 2*n
  print(2*n)
  if n > 1:
    sum += n - 5
    print(n - 5)
    F(n - 1)
    F(n - 2)
  return sum

for n in range(1000):
  if F(n) <= 5e5:
    sum = 0
  else:
    break

print(n)
print(sum)

# ====================================================================================================

# Определите, сколько символов * выведет эта процедура при вызове F(22)
sum = 0
def F(n):
  global sum
  print('*')
  sum += 1
  if n >= 1:
    print('*')
    sum += 1
    F(n - 1)
    F(n - 2)
    F(n - 3)
  return sum

print(F(22))
