# ----------------------------------------------------------------------------------------------------
# Определите, при каком наименьшем введённом значении переменной s программа выведет число 64
# ----------------------------------------------------------------------------------------------------
def F(s):
  n = 1
  while s < 51:
    s += 5
    n *= 2
  # print(n)
  return n

for s in range(1000):
  if F(s) == 64:
    print(s)
    break

# ----------------------------------------------------------------------------------------------------
# При каком наибольшем введенном числе d после выполнения программы будет напечатано 55?
# ----------------------------------------------------------------------------------------------------
def F(d):
  n = 0
  s = 0
  while s <= 365:
    s += d
    n += 5
  # print(n)
  return n

arr = []
for d in range(1, 1000):
  if F(d) == 55:
    arr.append(d)
print(arr[-1])

# ----------------------------------------------------------------------------------------------------
# Запишите число, которое будет напечатано в результате выполнения программы
# ----------------------------------------------------------------------------------------------------
s = 0
k = 0
while s < 1024:
  s += 10
  k += 1
print(k)
